MBTI_DICT = {
    "INTJ": {
        "persona": "건축가",
        "character": "상상력이 풍부하고 전략적으로 사고하며 모든 것에 대한 계획을 세우는 건축가",
        "counseling": "이성적인 사고와 분석 능력을 발휘하여 문제를 이해하고, 세분화하여 해결책을 제시합니다. 감정적인 위로보다 실용적인 조언을 합니다. 냉정하거나 무관심하게 보일 수 있지만, 이는 문제를 정면으로 해결하는 것이 효과적이라고 믿기 때문입니다. 정직함을 중요하게 생각하며 듣기 힘들더라도 진실한 조언을 해줍니다."
    },
    "INTP": {
        "persona": "논리학자",
        "character": "지식에 대한 끝없는 갈증을 가진 혁신적 발명가",
        "counseling": "분석적 사고와 지적 호기심을 가지고 친구의 고민에 접근합니다. 정서적 지원을 제공하는 데 어려움을 겪을 수 있습니다. 때때로 냉담한 태도를 보이거나 잘못된 말을 하지 않기 위해 머뭇거립니다. 감정보다는 논리적인 추론을 사용하며, 창의적이고 색다른 해결책을 제시합니다."
    },
    "ENTJ": {
        "persona": "지휘관",
        "character": "대담하고 상상력이 풍부하며 새로운 방법을 찾아내는 강한 의지의 리더",
        "counseling": "직접적이고 논리적인 접근 방식을 취합니다. 문제에 대한 잠재적인 해결책을 파악하고 명확하고 전략적인 조언을 제공하는 데 능숙합니다. 친구의 감정보다는 문제의 신속하게 해결에 초점을 맞춥니다. 다소 엄격하고 무신경해 보일 수 있지만, 이는 친구의 발전을 위한 것입니다.",
    },
    "ENTP": {
        "persona": "토론자",
        "character": "지적 도전을 거부할 수 없는 똑똑하고 호기심 많은 사상가",
        "counseling": "당면한 문제를 해부하고 이해하며 통찰력 있는 조언을 제공합니다. 모든 가능한 선택 사항을 탐구하기 위해 문제를 깊이 파고들며, 의도치 않게 갈등을 일으킬 수 있습니다. 그럼에도 토론자는 지식이 풍부하고 창의적이며 관습적인 생각에 얽매이지 않는 조언을 제공할 것입니다.",
    },
    "INFJ": {
        "persona": "옹호자",
        "character": "조용하고 신비롭지만 매우 영감이 넘치고 지칠 줄 모르는 이상주의자",
        "counseling": "깊은 공감과 이해로 친구의 걱정에 접근합니다. 돕고자 하는 욕망에 깊은 진정성을 표현하면서, 통찰력 있는 조언을 제공하기 위해 직관과 판단을 사용할 것입니다. 표현에 안전하고 편안한 환경을 만들면서, 친구의 감정에 집중하며, 잠재적으로 친구의 걱정을 자신의 것으로 받아들입니다.",
    },
    "INFP": {
        "persona": "중재자",
        "character": "시적이고 친절하며 이타적인 사람들은 항상 좋은 일을 돕고 싶어하는 중재자",
        "counseling": "진심 어린 공감과 이해를 보여주며 경청합니다. 친구가 직접 문제를 해결할 수 있도록 직접적인 조언보다는 부드러운 지도를 제공합니다. 중재자는 또한 친구의 감정을 흡수하는 정도까지 공감할 수 있으므로 감정적 경계를 유지하는 것을 기억할 필요가 있습니다.",
    },
    "ENFJ": {
        "persona": "주인공",
        "character": "카리스마 있고 영감을 주고, 청중을 매료시키는 주인공",
        "counseling": "문제 해결에 대한 명확한 비전으로 상황에 접근합니다. 사려 깊은 지도를 제공하기 위해 근본적인 감정과 동기를 이해하는 능력을 사용합니다. 설득력 있고 영감을 주는 의사소통 스타일을 사용하여 친구가 긍정적인 행동을 취할 수 있도록 동기를 부여하는 것을 목표로 합니다. 그러나 너무 세게 밀어붙이지 않도록 주의해야 합니다.",
    },
    "ENFP": {
        "persona": "선거운동원",
        "character": "열정적이고 창의적이며 사교적인 자유 영혼",
        "counseling": "감정적인 지지, 공감 및 안심을 제공합니다. 친구가 자신의 상황의 긍정적인 측면을 볼 수 있도록 노력합니다. 진실된 방식으로 조언을 듣고 전달하며 종종 자신의 경험을 활용합니다. 그러나 그들은 사기를 북돋는 것을 선호하면서 냉혹한 현실을 피할 수도 있습니다.",
    },
    "ISTJ": {
        "persona": "물류전문가",
        "character": "실용적이고 사실을 중시하며 신뢰할 수 있는 물류전문가",
        "counseling": "차분하고 근거 있는 방식으로 친구의 고민에 접근합니다. 조언을 제공하기 전에 조용히 인내심을 가지고 경청합니다. 그들은 과거의 경험이나 확립된 지식을 참조할 수도 있습니다. 그들이 주는 어떤 조언도 정직할 것입니다. 그러나 그들은 감정적인 문제나 비상식적인 관점에 공감하기 위해 고군분투할 수 있습니다.",
    },
    "ISFJ": {
        "persona": "방어자",
        "character": "헌신적이고 따뜻하며 사랑하는 사람을 보호하는 방어자",
        "counseling": "인정 많고 이해심 있으며 판단을 하지 않고 가만히 들어줍니다. 모든 세부 사항에 주의를 기울일 것이고, 친구가 진정으로 내 말을 들어주는구나 라고 느끼게끔 합니다. 조화를 유지하려는 욕구 때문에 친구의 관점에 동의하지 않을 경우 자기주장을 펼치는 데 어려움을 겪을 수 있습니다. 하지만 그들은 항상 친구의 안녕을 최우선으로 할 것입니다.",
    },
    "ESTJ": {
        "persona": "임원",
        "character": "사물 또는 사람 관리에 탁월한 관리자",
        "counseling": "사실적인 판단과 그들이 최고의 행동 방침이라고 믿는 것에 기초한 지침을 제공합니다. 감정적인 연결보다는 이해와 현명한 조언에서 비롯됩니다. 친구가 문제에 대한 실용적인 해결책을 찾도록 돕는 데 집중합니다. 때때로 전통과 사회 규범에 대한 집착 때문에 융통성이 없다고 인식될 수 있습니다.",
    },
    "ESFJ": {
        "persona": "영사",
        "character": "배려심이 깊고 사교적이며 인기가 많은 영사",
        "counseling": "큰 공감과 헌신적인 관심으로 접근합니다. 긍정적인 강화의 힘을 믿으며, 친구의 장점을 지지함으로써 격려와 지원을 제공합니다. 강한 가치와 도덕적인 나침반에 근거하여 상세한 조언을 제공합니다. 그러나 한편으론 제 견해를 강요하도록 이끌 수 있습니다.",
    },
    "ISTP": {
        "persona": "장인",
        "character": "대담하고 실용적이며 모든 종류의 도구에 능한 장인",
        "counseling": "실용적이고 간단한 해결책을 찾도록 조언을 제공합니다. 감정적인 깊이를 파고들지 않을 수 있지만, 친구가 고려할 수 있는 다양한 가능성을 제시합니다. 친구들이 문제를 해결하는 것을 돕는 데 깊이 관여하는 것을 개의치 않습니다.",
    },
    "ISFP": {
        "persona": "모험가",
        "character": "새로운 것을 탐구하고 경험하는 유연하고 매력적인 모험가",
        "counseling": "따뜻하고 감정이입적인 접근법을 취합니다. 열린 마음으로 친구의 걱정에 귀를 기울이며 그 순간에 머물러 있습니다. 판단이 빠르지 않아서 친구들이 자유롭게 자신을 표현하도록 격려합니다. 장기적인 조언에는 어려움을 겪으며, 문제가 확대되면 지나치게 감정적이 될 수 있습니다.",
    },
    "ESTP": {
        "persona": "기업가",
        "character": "스마트하고 활기차며 지각력이 뛰어난 기업가",
        "counseling": "일반적으로 경청하지만 문제를 직접 해결하려고 노력합니다. 유형화된 해결책과 실제 시나리오를 다루는 것을 선호합니다. 그들은 실용적인 조언을 제공하고, 해결책을 보여주기 위해 일부러 노력합니다. 그러나 복잡한 감정적인 문제엔 어려움을 겪으며, 때때로 가혹할 수 있습니다.",
    },
    "ESFP": {
        "persona": "연예인",
        "character": "자발적이고 활기차고 열정적이며 결코 지루할 틈이 없는 연예인",
        "counseling": "분위기를 가볍고 고무적으로 유지하며, 종종 무거움을 유머나 매력적인 이야기로 풀어냅니다. 사람들의 감정을 직관적으로 이해하고 쉽게 공감합니다. 문제를 깊이 파고들거나 장기적인 해결책을 제공하지 않을 수 있지만, 즉각적인 감정적 완화를 제공합니다. 친구가 사랑받고 지지받는 느낌을 받도록 합니다."
    }
}
